In [1]:
import pandas as pd

In [2]:
friends = [{'age':15,'job':'student'},
          {'age':25,'job':'developer'},
          {'age':30,'job':'teacher'}]

df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'],
                 columns = ['age','job'])

In [11]:
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

## 특정 인덱스를 삭제 하고 싶은 경우

In [4]:
df.drop(['John','Nate']) #삭제하고 싶은 인덱스

       age        job
Jenny   25  developer

In [5]:
df.drop(['John','Nate'] , inplace = True) #원본 데이터 자체가 변함

In [6]:
df

       age        job
Jenny   25  developer

In [9]:
friends = [{'name':'John', 'age':15,'job':'student'},
          {'name':'Jenny','age':25,'job':'developer'},
          {'name':'Nate','age':30,'job':'teacher'}]

df = pd.DataFrame(friends,
                 columns = ['name','age','job'])

In [10]:
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [13]:
df.drop(df.index[[0,2]])

    name  age        job
1  Jenny   25  developer

조건을 이용하여 삭제

In [15]:
df[df.age>20]

    name  age        job
1  Jenny   25  developer
2   Nate   30    teacher

## 특정 칼럼을 삭제하고 싶은 경우

In [16]:
df.drop('age',axis=1)

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

In [18]:
df.drop('job',axis =1)

    name  age
0   John   15
1  Jenny   25
2   Nate   30